//CREALOAD JOB 1,NOTIFY=&SYSUID
//LOAD     EXEC PGM=IEBCOPY
//SYSIN    DD DUMMY
//SYSPRINT DD DUMMY
//SYSUT1   DD DSN=MTM2020.PUBLIC.JCL,DISP=SHR
//SYSUT2   DD DSN=&SYSUID..JCL,DISP=(,CATLG,DELETE),
//       LIKE=MTM2020.PUBLIC.JCL
//LOAD2     EXEC PGM=IEBCOPY
//SYSIN    DD DUMMY
//SYSPRINT DD DUMMY
//SYSUT1   DD DSN=MTM2020.PUBLIC.WORK,DISP=SHR
//SYSUT2   DD DSN=&SYSUID..WORK,DISP=(,CATLG,DELETE),
//       LIKE=MTM2020.PUBLIC.WORK
