//DB2SETUP  JOB 1
//DBRMLIB EXEC PGM=IEFBR14
//DBRMLIB DD DSN=&SYSUID..DBRMLIB,DISP=(,CATLG),
// UNIT=3390,VOL=SER=DB2004,SPACE=(CYL,(1,1)),
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000,DSORG=PO),DSNTYPE=LIBRARY
/*
