//JES1JOB1 JOB 1
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=CNVTSYS
  DELETE &SYSUID..SECRET.WORD
  SET MAXCC=0
//SECRET EXEC PGM=ICEGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=MTM2020.PUBLIC.INPUT(SECRET),DISP=SHR
//SYSUT2   DD DSN=&SYSUID..SECRET.WORD,DISP=(NEW,CATLG,DELETE),
//         UNIT=SYSALLDA,SPACE=(TRK,1),
//         DCB=(LRECL=80,DSORG=PS,RECFM=F)
//SYSIN    DD DUMMY
